simulations/multi_grid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	inlet
	{
		type            zeroGradient;
	}

	outlet
	{
		type            fixedValue;
		//value           $internalField;
		value		uniform 0;
	}

	ellipse
	{
		type            zeroGradient;
	}

	topAndBottom
	{
		type            slip;
	}

	frontAndBack
	{
		type            empty;
	}

	defaultFaces
	{
		type            empty;
	}
}

// ************************************************************************* //
